/**

  Задача:
  Дана символьная строка с некоторым выражением, в котором могут содержаться скобки трех видов: {}, [], ().
  Написать метод проверки правильности расстановки скобок в этой строке.

  Принцип работы алгоритма.

  Требования:
  - использовать классы стека или очереди для реализации задачи
  - ввод-вывод данных об объекте родителя и потомка

  Входные значения для тестирования:


*/

#include <iostream>
#include <math.h>
#include <string>
#include <iomanip>
#include <sstream>

using namespace std;



int main(int argc, char const *argv[]) {
  return 0;
}
